In [3]:
import pandas as pd

In [4]:
valores = [6,8,34,94,-78]
indice = range(len(valores))

serie1 = pd.Series(data = valores, index = indice)
serie1

0     6
1     8
2    34
3    94
4   -78
dtype: int64

In [5]:
valores2 = [28,45,-852, 3, 16]
serie2 = pd.Series(index=indice, data=valores2)
serie2

0     28
1     45
2   -852
3      3
4     16
dtype: int64

In [9]:
34**(-852)

0.0

In [10]:
import numpy as np

In [11]:
array = np.random.normal(-10,10, size=[4,4])
array

array([[-10.7985219 ,  -4.35850644, -18.47188942,  10.03865283],
       [-20.25164014, -12.3132208 , -28.74125708, -11.04089634],
       [ -4.81654686, -10.73207034,   6.06051837, -17.62715355],
       [-13.30984362,  -1.93176784,  -3.60875928,   8.00396351]])

In [12]:
pd. DataFrame([[2,3],[4,5]], index=['a','b'], columns=['W','X'])

   W  X
a  2  3
b  4  5

In [13]:
pd. DataFrame(array)

           0          1          2          3
0 -10.798522  -4.358506 -18.471889  10.038653
1 -20.251640 -12.313221 -28.741257 -11.040896
2  -4.816547 -10.732070   6.060518 -17.627154
3 -13.309844  -1.931768  -3.608759   8.003964

In [14]:
len(array)

4

In [16]:
df = pd. DataFrame(array, index=range(1, len(array)+1))
df

           0          1          2          3
1 -10.798522  -4.358506 -18.471889  10.038653
2 -20.251640 -12.313221 -28.741257 -11.040896
3  -4.816547 -10.732070   6.060518 -17.627154
4 -13.309844  -1.931768  -3.608759   8.003964

In [17]:
df = pd. DataFrame(array, index=range(1, len(array)+1), columns=['W', 'X', 'Y','Z'])
df

           W          X          Y          Z
1 -10.798522  -4.358506 -18.471889  10.038653
2 -20.251640 -12.313221 -28.741257 -11.040896
3  -4.816547 -10.732070   6.060518 -17.627154
4 -13.309844  -1.931768  -3.608759   8.003964

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df['X']

1    -4.358506
2   -12.313221
3   -10.732070
4    -1.931768
Name: X, dtype: float64

In [20]:
df['X'][2]

np.float64(-12.313220796127254)

In [21]:
df.X

1    -4.358506
2   -12.313221
3   -10.732070
4    -1.931768
Name: X, dtype: float64

In [23]:
df[['W','Y']] #FILTADODE DF, PRIMER CORCHETE AVISA QUE VAS A HACER SLACING, SEGUNDA SON LAS COLUMNAS DE MI INTERES COMO LISTA

           W          Y
1 -10.798522 -18.471889
2 -20.251640 -28.741257
3  -4.816547   6.060518
4 -13.309844  -3.608759

In [24]:
columnas = ['W','Y']
df[columnas]

           W          Y
1 -10.798522 -18.471889
2 -20.251640 -28.741257
3  -4.816547   6.060518
4 -13.309844  -3.608759

In [25]:
df.X+df.Y

1   -22.830396
2   -41.054478
3    -4.671552
4    -5.540527
dtype: float64

In [28]:
df['suma_X_Y'] = df.X+df.Z
df

           W          X          Y          Z   suma_X_Y
1 -10.798522  -4.358506 -18.471889  10.038653   5.680146
2 -20.251640 -12.313221 -28.741257 -11.040896 -23.354117
3  -4.816547 -10.732070   6.060518 -17.627154 -28.359224
4 -13.309844  -1.931768  -3.608759   8.003964   6.072196

In [33]:
df.drop('Y', axis=1, inplace= True) #eliminar columna, axis=1 borras columna, si es axis=0 es fila
df

           W          X          Z   suma_X_Y
1 -10.798522  -4.358506  10.038653   5.680146
2 -20.251640 -12.313221 -11.040896 -23.354117
3  -4.816547 -10.732070 -17.627154 -28.359224
4 -13.309844  -1.931768   8.003964   6.072196

In [34]:
df.drop(3, axis=0)

           W          X          Z   suma_X_Y
1 -10.798522  -4.358506  10.038653   5.680146
2 -20.251640 -12.313221 -11.040896 -23.354117
4 -13.309844  -1.931768   8.003964   6.072196

In [35]:
df.loc[3] #acceder a una fila

W           -4.816547
X          -10.732070
Z          -17.627154
suma_X_Y   -28.359224
Name: 3, dtype: float64

In [ ]:
df.loc[1]

In [36]:
#localización del índice
df.iloc[0]

W          -10.798522
X           -4.358506
Z           10.038653
suma_X_Y     5.680146
Name: 1, dtype: float64

In [37]:
df. iloc[[0,2]]

           W          X          Z   suma_X_Y
1 -10.798522  -4.358506  10.038653   5.680146
3  -4.816547 -10.732070 -17.627154 -28.359224

In [38]:
df.loc[3,'X']

np.float64(-10.732070344002484)

In [41]:
df.loc[[2,4],['X','suma_X_Y']]

           X   suma_X_Y
2 -12.313221 -23.354117
4  -1.931768   6.072196